import React, { useEffect, useState } from 'react';
import "../App.css";

function Terms() {
    return (
        <div className="Terms">
            <div>terms of use</div>
            <div>이 어플리케이션의 내용(이하 앱)는 뉴토 그룹(이하 뉴토)가 소유하고 있습니다. 앱를 이용하거나 앱에서 자료를 다운로드 시 이용 약관에 명시된 사용약관을 준수하는데 동의합니다.</div>
            <br />
            <div>저작권과 상표 Copyrights and trademarks</div>
            <div>모든 저작권과 상표는 뉴토의 의해 저작권보호를 받습니다. 모든 저작권은 뉴토의 소유입니다. 앱의 내용을 인쇄할 수 있는 있으나 사전 서면 허가 없이 전체 또는 일부를 수정, 복사, 배포, 게시, 다운로드, 표시 또는 어떠한 형태나 방법으로 매매를 할 수 없으며 뉴토와 경쟁하거나 비방하려는 용도로 사용하는 것을 허락하지 않습니다.</div>
            <br />
            <div>모든 뉴토의 상표, 상표명, 로고, 제품명, 회사명은 뉴토의 사전 서면 허가 없이 전체 또는 일부를 복제, 모방하여 사용할 수 없습니다.</div>
            <br />
            <div>정보의 소스가 명시되어 있는 경우 기사, 보도자료 및 공개로 분류된 다른 문서 등은 공공 언론용으로 허가 됩니다.</div>
            <br />
            <div>본 앱의 내용(The content of the Site)</div>
            <div>상기 앱에서 제공되는 기술 도면, 설정, 견적 및 주문 정보들은 제공되지 않으며 모든 자료들은 업데이트 되지 않은 부정확한 자료를 포함하고 있을 수 있습니다. 뉴토는 앱 또는 그 컨텐츠가 귀하의 요구사항을 충족시켜 주지 않을 수도 있으며 내용이 업데이트 되지 않거나 오류가 있을 수 도 있습니다. 본 앱의 정보가 귀하의 국가에서 사용할 수 없는 뉴토의 제품이나 서비스에 대한 정보를 포함하고 있을 수 있습니다. 해당 국가의 뉴토 제품에 대한 관련 정보는 각 국가 담당자에게 문의하시기 바랍니다.</div>
            <br />
            <div>본 앱에서 제공되는 컨텐츠에 앱에 명시된 있는 그대로이며 어떤 종류의 묵시적인 의미의 용도나 사용에 대한 책임 보증을 제한하며 보장을 하지 않습니다. 뉴토의 귀하의 비즈니스, 컴퓨터 시스템 혹은 어떤 손실 피해에 대해 책임을 지지 않습니다.</div>
            <br />
            <div>제3자 콘텐츠 및 다른 웹앱로의 링크(The third party content and the links to other web sites)</div>
            <div>본 앱에 포함된 매터리얼, 자료 혹은 정보에 대한 활용에 대해 뉴토의 책임은 없으며 제3자가 활용할 수 있으나 광고를 포함하여 활용 할 수는 없습니다.</div>
            <br />
            <div>본 앱는 수시로 다른 웹앱로 연결되는 링크를 포함하여 사용할 수 있습니다. 이러한 링크는 편의를 위해 제공되며 링크된 웹앱, 컨텐츠, 서비스 혹은 제품에 대해 뉴토는 책임을 지지 않습니다.</div>
            <br />
            <div>본 앱를 통한 혹은 앱에서의 커뮤니케이션(Communications on or through the Site)</div>
            <div>귀하가 전자메일이나 앱를 통해 질문, 의견, 구성, 사양, 구매주문에 대해 전송된 정보는 기밀이 아닌 비 독점 정보이며 뉴토에 의해서 사용될 수 있는 것을 동의합니다. 귀하는 뉴토가 귀하의 정보를 게시 할 수 있으며, 어떠한 목적으로 이러한 정보를 자유롭게 사용 할 수 있으며 뉴토의 제품 구성과 컨셉에 사용될 수 있는 것을 동의합니다. 귀하는 귀하가 제출한 정보에 대해 뉴토가 제3자에게서 악의적인 의도 없이 사용되는 것에 동의합니다.</div>
            <br />
            <div>책임의 한계(Limitation of liability)</div>
            <div>뉴토는 귀하가 본 앱를 이용 중 일어나는 직접, 간접, 특별 혹은 결과적 손해에 대해 어떠한 경우에도 책임을 지지 않습니다. 앱를 사용 중 불가항력적인 이익 손실, 사업중단, 정보 처리 시스템 또는 기타의 프로그램이나 기타 데이터의 손실에 대한 어떠한 책임을 지지 않습니다. 본 앱와 서버에는 바이러스나 기타 유해한 정보가 없음을 보증합니다.</div>
            <br />
            <div>적용법률 및 관할(Applicable law and competent jurisdiction)</div>
            <div>이용 약관은 한국 법을 적용합니다. 본 약관의 해석 및 효력에 대하 모든 분쟁은 한국 서울 지방법원의 전속관할에 제출되어야 합니다.</div>
        </div>
    );
}

export default Terms;
